constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    topAtmosphere
    {
        type            patch;
        nFaces          25000;
        startFace       7420000;
    }
    bottomSample
    {
        type            patch;
        nFaces          25000;
        startFace       7445000;
    }
    leftAndRightAtmosphere
    {
        type            patch;
        nFaces          5000;
        startFace       7470000;
    }
    leftAndRightSample
    {
        type            patch;
        nFaces          5000;
        startFace       7475000;
    }
    backSample
    {
        type            patch;
        nFaces          25000;
        startFace       7480000;
    }
    backAtmosphere
    {
        type            patch;
        nFaces          25000;
        startFace       7505000;
    }
    symmetryBc
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          50000;
        startFace       7530000;
    }
)

// ************************************************************************* //
