constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (steel argon);

//water
steel
{
    transportModel  Newtonian;

    nu              [0 2 -1 0 0 0 0] 7.044e-07;  //Steel
    rho             [1 -3 0 0 0 0 0] 7950;      //Steel
}

argon
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 2.23e-05;
    rho             [1 -3 0 0 0 0 0] 1.664;
}

sigma           [1 0 -2 0 0 0 0] 1.943; //Steel

/* phases (water air);
water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}

sigma            0.07;
 */
// ************************************************************************* //
