0/Gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    bottomSample
    {
        type fixedValue;
        value uniform 0;
    }
    leftAndRightSample
    {
        type fixedValue;
        value uniform 0;
    }
    backSample
    {
        type fixedValue;
        value uniform 0;
    }
    topAtmosphere
    {
        type fixedValue;
        value uniform 0;
    }
    leftAndRightAtmosphere
    {
        type fixedValue;
        value uniform 0;
    }
    backAtmosphere
    {
        type fixedValue;
        value uniform 0;
    }
    symmetryBc
    {
        type symmetryPlane;
    }
}
// ************************************************************************* //
