system/energy
// Writes kinetic energy of entire domain

type    energy;
libs    ("libenergyFunctionObject.so");
rho     1.2;

